cxandy/S3-Amysynth/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.1.0 Project Minimal Configuration
#
# default:
CONFIG_IDF_TARGET="esp32s3"
# PERF (2026-06): flash QIO @ 80MHz. Was QOUT (quad-out, 2x slower address
# phase). The S3-WROOM-1 in-package quad flash supports QIO. Faster
# instruction fetch for all flash-resident (non-IRAM) code.
CONFIG_ESPTOOLPY_FLASH_MODE_AUTO_DETECT=n
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_FILTER_SCOPE=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_STACK_CHECK_MODE_NORM=y
# Deliberate libc choice, NOT redundant: picolibc became the IDF default only
# in v6.1. Keep it explicit so regenerating sdkconfig under IDF 6.0.x does not
# silently fall back to newlib (this file is shared across IDF versions).
CONFIG_LIBC_PICOLIBC=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_SMP_ID_RESET=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_HANDLE_REPEAT_PAIRING_DELETION=y
CONFIG_BT_NIMBLE_HS_PVCY=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=2
CONFIG_BT_NIMBLE_GATT_CACHING=y
CONFIG_BT_NIMBLE_MEMPOOL_RUNTIME_ALLOC=y
CONFIG_BT_NIMBLE_MEMPOOL_BLOCK_REUSED=y
CONFIG_BT_NIMBLE_PROX_SERVICE=n
CONFIG_BT_NIMBLE_ANS_SERVICE=n
CONFIG_BT_NIMBLE_CTS_SERVICE=n
CONFIG_BT_NIMBLE_HTP_SERVICE=n
CONFIG_BT_NIMBLE_IPSS_SERVICE=n
CONFIG_BT_NIMBLE_TPS_SERVICE=n
CONFIG_BT_NIMBLE_IAS_SERVICE=n
CONFIG_BT_NIMBLE_SPS_SERVICE=n
CONFIG_BT_NIMBLE_HR_SERVICE=n
CONFIG_BT_NIMBLE_BAS_SERVICE=n
CONFIG_BT_NIMBLE_DTM_MODE_TEST=n
CONFIG_BT_NIMBLE_LOW_SPEED_MODE=y
CONFIG_BT_NIMBLE_LOG_LEVEL_WARNING=y
CONFIG_BT_NIMBLE_PRINT_ERR_NAME=n
CONFIG_BT_NIMBLE_HIGH_DUTY_ADV_ITVL=y
CONFIG_BT_CTRL_BLE_MAX_ACT=3
# RELIABILITY (2026-07): let the render-clock GPTimer ISR run while the flash
# cache is disabled (LittleFS project I/O, NVS). Without it the alarm interrupt
# is masked for the whole cache-off window: pending alarms collapse to one
# delivery, so the render/sequencer clock silently loses time and the stall is
# invisible to the overrun counter. With it, ticks keep arriving and a stall
# surfaces honestly as counted render_overruns. Safe here: the handler is
# IRAM_ATTR, cache-safe mode keeps driver state in DRAM, and
# vTaskNotifyGiveFromISR stays in IRAM (FREERTOS_PLACE_ISR_FUNCTIONS_INTO_FLASH
# is off).
CONFIG_GPTIMER_ISR_CACHE_SAFE=y
CONFIG_I2C_MASTER_ISR_HANDLER_IN_IRAM=n
CONFIG_I2S_ISR_IRAM_SAFE=y
CONFIG_PCNT_ISR_IRAM_SAFE=y
CONFIG_ESP_NETIF_LOST_IP_TIMER_ENABLE=n
CONFIG_ESP_NETIF_REPORT_DATA_TRAFFIC=n
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY=y
CONFIG_RINGBUF_PLACE_ISR_FUNCTIONS_INTO_FLASH=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# PERF (2026-06): double the ESP32-S3 instruction cache from 16KB to 32KB.
# Most AMY DSP code still executes from flash through this cache (only the
# hottest functions are pinned to IRAM via components/amy/amy_iram.lf), so a
# larger I-cache reduces miss-stalls on the render path. Costs 16KB of internal
# SRAM, which we have to spare.
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=8
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n
CONFIG_ESP_DEBUG_OCDAWARE=n
CONFIG_ESP_SYSTEM_BBPLL_RECALIB=n
CONFIG_ESP_IPC_TASK_STACK_SIZE=2560
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUFFER=y
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n
CONFIG_ESP_WIFI_NVS_ENABLED=n
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=n
CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA=n
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=n
CONFIG_ESP_WIFI_GMAC_SUPPORT=n
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n
CONFIG_ESP_WIFI_MBEDTLS_CRYPTO=n
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=2048
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_APPLICATION_TASK_TAG=y
CONFIG_HEAP_PLACE_FUNCTION_INTO_FLASH=y
CONFIG_LOG_COLORS=y
CONFIG_LWIP_TCPIP_TASK_PRIO=5
CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES=n
CONFIG_LWIP_TIMERS_ONDEMAND=n
CONFIG_LWIP_SO_REUSE=n
CONFIG_LWIP_IPV6=n
CONFIG_LWIP_NETIF_LOOPBACK=n
CONFIG_LWIP_TCP_HIGH_SPEED_RETRANSMISSION=n
CONFIG_LWIP_TCP_QUEUE_OOSEQ=n
CONFIG_LWIP_CHECKSUM_CHECK_ICMP=n
CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU0=y
CONFIG_LWIP_ICMP=n
CONFIG_LWIP_SNTP_STARTUP_DELAY=n
CONFIG_LWIP_ESP_LWIP_ASSERT=n
CONFIG_MBEDTLS_FS_IO=n
CONFIG_MBEDTLS_THREADING_C=n
CONFIG_MBEDTLS_ERROR_STRINGS=n
CONFIG_MBEDTLS_VERSION_C=n
CONFIG_MBEDTLS_HAVE_TIME=n
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=n
CONFIG_MBEDTLS_SELF_TEST=n
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y
CONFIG_MBEDTLS_AES_FEWER_TABLES=y
CONFIG_SD_ENABLE_SDIO_SUPPORT=n
CONFIG_SPI_FLASH_ROM_IMPL=y
CONFIG_VFS_SELECT_IN_RAM=y
CONFIG_VFS_SUPPORT_TERMIOS=y
CONFIG_VFS_SEMIHOSTFS_MAX_MOUNT_POINTS=2
CONFIG_SEQ_QUANTIZER_DEFAULT_SCALE=5
CONFIG_SEQ_MEL_VOICES=2
CONFIG_SEQ_PATCH_BROWSE_FULL_RANGE=y
CONFIG_SEQ_DRUM_GATE_NUMERATOR=1
CONFIG_SEQ_DRUM_GATE_DENOMINATOR=2
CONFIG_SEQ_MELODIC_ENV_ATTACK_MS=5
CONFIG_SYNTH_ADDITIVE=y
CONFIG_SEQ_ARP_DEFAULT_GATE_PCT=50
CONFIG_SEQ_ARP_DEFAULT_OCTAVES=2
CONFIG_SEQ_ARP_DEFAULT_PATCH=1
CONFIG_SEQ_FX_DEFAULT_ECHO=5
CONFIG_SEQ_FX_DEFAULT_REVERB=35
CONFIG_SEQ_FX_DEFAULT_CHORUS=40
CONFIG_UAC_TUSB_PRODUCT="AmyBox"
CONFIG_UAC_SPEAKER_CHANNEL_NUM=0
CONFIG_UAC_MIC_CHANNEL_NUM=2
CONFIG_UAC_SPK_INTERVAL_MS=-1
CONFIG_UAC_MIC_INTERVAL_MS=1
# Async-source mic pull: the EP-IN FIFO absorbs whole 5.33 ms render
# blocks, so its flow-control setpoint (depth/2) must exceed one block
# plus one packet or the fill trough between blocks grazes zero-length
# packets. Measured sweep: 0.28 ZLP/s at 6 ms, 0.06/s at 8 ms, zero at
# 10 and 12 ms. 12 ms = 6 ms setpoint = comfortably past one-frame jitter.
CONFIG_UAC_MIC_FIFO_DEPTH_MS=12
CONFIG_UAC_SPK_NEW_PLAY_INTERVAL=-1
CONFIG_UAC_TINYUSB_TASK_PRIORITY=9
# Pin the TinyUSB UAC tasks to Core 0 (was -1 / no affinity). This keeps the
# USB stack deterministically next to its ISR on Core 0 and away from the AMY
# DSP render task, which is pinned to Core 1.
CONFIG_UAC_TINYUSB_TASK_CORE=0
CONFIG_UAC_MIC_TASK_PRIORITY=9
CONFIG_UAC_MIC_TASK_CORE=0
CONFIG_SYNTH_WIRELESS=y
CONFIG_LITTLEFS_MALLOC_STRATEGY_SPIRAM_PREFER=y

# USER HARDWARE (2026-09): this machine's custom-PCB layout. All pins come from
# the "User Hardware" Kconfig menu (main/Kconfig.projbuild) and the Display /
# I2S DAC menus, whose defaults are the upstream devkit layout; only the
# differences are listed here, so a sync with upstream touches just this block.
# Kconfig defaults: SHOULDER=15, B1=18, B2=8, B3=42, ENC=16, B0=17, SHIFT=47,
# transport=none, pots=none, encoder A=40/B=41, OLED SCL=5/SDA=4, panel SSD1315.
CONFIG_AMYSYNTH_BTN_SHOULDER_GPIO=42
CONFIG_AMYSYNTH_BTN_1_GPIO=40
CONFIG_AMYSYNTH_BTN_2_GPIO=41
CONFIG_AMYSYNTH_BTN_3_GPIO=39
CONFIG_AMYSYNTH_BTN_ENC1_GPIO=18
CONFIG_AMYSYNTH_BTN_0_GPIO=1
CONFIG_AMYSYNTH_BTN_SHIFT_GPIO=0
CONFIG_AMYSYNTH_BTN_TRANSPORT_GPIO=2
CONFIG_AMYSYNTH_POT_CUTOFF_GPIO=8
CONFIG_AMYSYNTH_POT_FX_GPIO=9
CONFIG_AMYSYNTH_POT_VOLUME_GPIO=10
CONFIG_AMYSYNTH_ENCODER_A_GPIO=17
CONFIG_AMYSYNTH_ENCODER_B_GPIO=16
CONFIG_AMYSYNTH_MIDI_CLOCK_TX_GPIO=15
CONFIG_AMYSYNTH_MIDI_IN_GPIO=4
CONFIG_AMYSYNTH_MIDI_CLOCK_SLAVE=y
CONFIG_I2C_U8G2_SCL_GPIO=11
CONFIG_I2C_U8G2_SDA_GPIO=21
CONFIG_I2C_U8G2_PANEL_SH1106=y
CONFIG_AMYSYNTH_I2S_DAC=y
